Revit 2024 API
PanelScheduleSheetInstance.SplitSegment Method
 Split the panel schedule into Thrown if the index is out of bounds.
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2011
Syntax
C#
public bool SplitSegment(
	int iSeg
)
Visual Basic
Public Function SplitSegment ( _
	iSeg As Integer _
) As Boolean
Visual C++
public:
bool SplitSegment(
	int iSeg
)
Parameters
iSeg
Type: System.Int32
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentException |  The iSeg is not a valid segment index. -or-
See Also
PanelScheduleSheetInstance Class
Autodesk.Revit.DB.Electrical Namespace